# IsAdaptiveFamilySymbol Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdaptiveComponentInstanceUtils..::..IsAdaptiveFamilySymbol Method
AdaptiveComponentInstanceUtils Class See Also
---
Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsAdaptiveFamilySymbol(
	FamilySymbol famSymb
)
```

Visual Basic
---
```text
Public Shared Function IsAdaptiveFamilySymbol ( _
	famSymb As FamilySymbol _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAdaptiveFamilySymbol(
	FamilySymbol^ famSymb
)
```

# ### Parameters
famSymb
    Type: Autodesk.Revit.DB..::..FamilySymbol The FamilySymbol
# ### Return Value
True if the FamilySymbol is a valid Adaptive Family Symbol.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace